wouyanglv/ble-archives/nRF5_SDK_17.0.0_9d13099/examples/ble_peripheral/eeg_emg_v1_samplespacked_PCB_app_BLEtemperature/main.c
#define DEAD_BEEF                           0xDEADBEEF                              /**< Value used as error code on stack dump, can be used to identify stack location on stack unwind. */

#define EEG_SPI_INSTANCE      SPI_INSTANCE_0
#define EMG_SPI_INSTANCE      SPI_INSTANCE_1

#define TIMESTAMP_PRECISION   1000000000
#define RTC_BIT_WIDTH         24

#define USE_EEG   true  
#define USE_EMG   true

#define MODALITY_EEGEMG 0
#define MODALITY_TEMP 1

BLE_BIOSIG_SVC_DEF(m_biosig_svc);                                   /**< BioSignal service instance. */
BLE_BAS_DEF(m_bas);                                                 /**< Structure used to identify the battery service. */
NRF_BLE_GATT_DEF(m_gatt);                                           /**< GATT module instance. */
NRF_BLE_QWR_DEF(m_qwr);                                             /**< Context for the Queued Write module.*/
BLE_ADVERTISING_DEF(m_advertising);                                 /**< Advertising module instance. */
APP_TIMER_DEF(m_power_level_timer_id);                              /**< Power level timer. */
APP_TIMER_DEF(m_startup_delay_timer_id);                            /**< Startup delay timer. */
APP_TIMER_DEF(m_temperature_timer_id);

static uint16_t m_conn_handle         = BLE_CONN_HANDLE_INVALID;    /**< Handle of the current connection. */

static ble_uuid_t m_adv_uuids[] =                                   /**< Universally unique service identifiers. */
{
    {BLE_UUID_BIOSIG_SERVICE,           BLE_UUID_TYPE_VENDOR_BEGIN}
};

static ble_uuid_t m_more_adv_uuids[] =
{
    {BLE_UUID_BIOSIG_MEASUREMENT_CHAR,  BLE_UUID_TYPE_VENDOR_BEGIN}
};

static bool             m_startup_delay;
static max30003_dev_t   m_eeg_dev;
static max30003_dev_t   m_emg_dev;
static bool             m_eeg_data_avail;
static bool             m_emg_data_avail;

static const nrfx_rtc_t   m_rtc = NRFX_RTC_INSTANCE(2); /**< Declaring an instance of nrf_drv_rtc for RTC2 (RTC0 is used by BLE, RTC1 used by app timer). */
static uint64_t           m_rtc_overflows;
static uint64_t           m_ns_per_tick;
static bool               m_rtc_init;

static uint64_t           m_sample_num[MAX30003_NUM_DEV_INSTANCES];

static bool EEG_read = false;
static bool EMG_read = false;
#define FRAME_NUM 32 //make sure it is consistent with efit in max30003.c
static int16_t eeg_emg_buffer[FRAME_NUM * 2] = {0};


/**@brief Callback function for asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num   Line number of the failing ASSERT call.
 * @param[in] file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}


/**@brief Clear bond information from persistent storage.
 */
static void delete_bonds(void)
{
    ret_code_t err_code;

    NRF_LOG_INFO("Erase bonds!");

    err_code = pm_peers_delete();
    APP_ERROR_CHECK(err_code);
}




/**@brief Function for starting advertising.
 */
void advertising_start(bool erase_bonds)
{
    if (erase_bonds == true)
    {
        delete_bonds();
        // Advertising is started by PM_EVT_PEERS_DELETE_SUCCEEDED event.
    }
    else
    {
        ret_code_t err_code;

        err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
        APP_ERROR_CHECK(err_code);
    }
}


/**@brief Function for advertising wrapper.
 */
static void advertising_start_handler(void *p_event_data, uint16_t event_size) 
{
  advertising_start(false);
}
/**@brief Function for handling Peer Manager events.
 *
 * @param[in] p_evt  Peer Manager event.
 */
static void pm_evt_handler(pm_evt_t const * p_evt)
{
    pm_handler_on_pm_evt(p_evt);
    pm_handler_flash_clean(p_evt);

    switch (p_evt->evt_id)
    {
        case PM_EVT_PEERS_DELETE_SUCCEEDED:
            advertising_start(false);
            break;

        default:
            break;
    }
}


/**@brief Function for performing power level measurement and updating the Power Level characteristic
 *        in Battery Service.
 */
//static uint8_t pl = 100;
//
//static void power_level_update(void)
//{
//    ret_code_t err_code;
//    uint8_t  power_level;
//
//    power_level = pl;
//    pl--;
//    if (pl == 0)
//      pl = 100;
//
//    err_code = ble_bas_battery_level_update(&m_bas, power_level, BLE_CONN_HANDLE_ALL);
//    if ((err_code != NRF_SUCCESS) &&
//        (err_code != NRF_ERROR_INVALID_STATE) &&
//        (err_code != NRF_ERROR_RESOURCES) &&
//        (err_code != NRF_ERROR_BUSY) &&
//        (err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)
//       )
//    {
//        APP_ERROR_HANDLER(err_code);
//    }
//}


/**@brief Function for handling the Power Level measurement timer timeout.
 *
 * @details This function will be called each time the power level measurement timer expires.
 *
 * @param[in] p_context  Pointer used for passing some arbitrary information (context) from the
 *                       app_start_timer() call to the timeout handler.
 */
//static void power_level_meas_timeout_handler(void * p_context)
//{
////SEGGER_RTT_printf(0,"timeout\n");
//    UNUSED_PARAMETER(p_context);
//   power_level_update();
//    //    if (m_conn_handle != BLE_CONN_HANDLE_INVALID)
//    //    {
////              if(USE_EMG)
////              {
////              read_sensor_data(&m_emg_dev, BLE_BIOSIG_DEV_TYPE_EMG);
////              }
////              if(USE_EEG)
////              {
////              read_sensor_data(&m_eeg_dev, BLE_BIOSIG_DEV_TYPE_EEG);
////              }
////              
//       // }
//}

/**@brief Function for handling the Startup Delay timer timeout.
 *
 * @details Can now start normal startup
 *
 * @param[in] p_context  Pointer used for passing some arbitrary information (context) from the
 *                       app_start_timer() call to the timeout handler.
 */
static void startup_delay_timeout_handler(void * p_context)
{
    UNUSED_PARAMETER(p_context);
    m_startup_delay = false;
}


