wouyanglv/ble-archives/nRF5_SDK_17.0.0_9d13099/examples/ble_peripheral/eeg_emg_v1_samplespacked_PCB_app_BLEtemperature/main.c
    memset(&init, 0, sizeof(init));

    init.advdata.name_type               = BLE_ADVDATA_FULL_NAME;
    init.advdata.include_appearance      = true;
    init.advdata.flags                   = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;
    init.advdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    init.advdata.uuids_complete.p_uuids  = m_adv_uuids;

    init.srdata.uuids_more_available.uuid_cnt = sizeof(m_more_adv_uuids)/sizeof(m_more_adv_uuids[0]);
    init.srdata.uuids_more_available.p_uuids = m_more_adv_uuids;
    
    init.config.ble_adv_fast_enabled  = true;
    init.config.ble_adv_fast_interval = APP_ADV_INTERVAL;
    init.config.ble_adv_fast_timeout  = APP_ADV_DURATION;

    init.evt_handler = on_adv_evt;

    err_code = ble_advertising_init(&m_advertising, &init);
    APP_ERROR_CHECK(err_code);

    ble_advertising_conn_cfg_tag_set(&m_advertising, APP_BLE_CONN_CFG_TAG);
}


/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
static void buttons_leds_init(bool * p_erase_bonds)
{
    ret_code_t err_code;
    bsp_event_t startup_event;

#ifdef NRF52_DK
    err_code = bsp_init(BSP_INIT_LEDS | BSP_INIT_BUTTONS, bsp_event_handler);
    APP_ERROR_CHECK(err_code);
#endif

    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);

    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
    ret_code_t err_code;

    err_code = nrf_ble_lesc_request_handler();
    APP_ERROR_CHECK(err_code);

    if (NRF_LOG_PROCESS() == false)
    {
        nrf_pwr_mgmt_run();
    }
}


static void eeg_data_avail_handler()
{
    m_eeg_data_avail = true;
    SEGGER_RTT_printf(0,"int eeg\n");
}

static void emg_data_avail_handler()
{
    m_emg_data_avail = true;
     SEGGER_RTT_printf(0,"int emg\n");
}


static void read_sensor_data(max30003_dev_t *dev, ble_biosig_svc_dev_type dev_type)
{
    uint32_t ecgFIFO, ETAG, status;
    int16_t ecgSample;
    uint64_t last_sample_timestamp;
    uint8_t num_samples = 0;
    uint8_t i;
    ret_code_t ret;
    ret_code_t err_code;
    bool retry_ble_send = false;
  
    /* Read back ECG samples from the FIFO */
    ret = max30003_get_status(dev, &status);      // Read the STATUS register

    // Check if EINT interrupt asserted
    if ((status & EINT_STATUS) == EINT_STATUS) 
    {     
//        last_sample_timestamp = rtc_timestamp_get();
        
        do 
        {
            max30003_get_fifo(dev, &ecgFIFO);                        // Read FIFO

            ecgSample = (ecgFIFO >> 8) & 0xFFFF;   // Isolate voltage data
            ETAG = (ecgFIFO >> 3) & ETAG_BITS;     // Isolate ETAG
    
            eeg_emg_buffer[(uint8_t) dev_type + num_samples*2] = ecgSample;
//            if (num_samples == 15) {SEGGER_RTT_printf(0, "Device : %d, No. %d, Signal: %d\n\r", dev_type, num_samples, ecgSample);}
            num_samples++;
        } 
        while (ETAG == FIFO_VALID_SAMPLE || ETAG == FIFO_FAST_SAMPLE);   // Check that sample is not last sample in FIFO              

//        SEGGER_RTT_printf(0, "ETAG: %d\r\n", ETAG);
//        SEGGER_RTT_printf(0, "%d samples read from FIFO\r\n", num_samples);
    
        // Check if FIFO has overflowed
        if(ETAG == FIFO_OVF)
        {                  
            max30003_reset_fifo(dev); // Reset FIFO
            SEGGER_RTT_printf(0, "FIFO overflow!\r\n");
        }
    }
    else if ((status & EOVF_STATUS) == EOVF_STATUS)
    {
        max30003_reset_fifo(dev); // Reset FIFO
    }

    // Check if FIFO overflowed while we were sending BLE data, if so reset the FIFO
    ret = max30003_get_status(dev, &status);      // Read the STATUS register
    if ((status & EOVF_STATUS) == EOVF_STATUS)
    {
        max30003_reset_fifo(dev); // Reset FIFO
    }

    if (dev_type == BLE_BIOSIG_DEV_TYPE_EEG) {
      EEG_read = true;
    } else {
      EMG_read = true;
    }
}



/**@brief Function for application main entry.
 */
int main(void)
{
 
    bool erase_bonds;

    // Initialize timers
    log_init();
    timers_init();

    // Delay startup to allow power harvesting to ramp up
    lfclk_request();  //turn on here because we need it before softdevice is started
    m_startup_delay = true;
    ret_code_t err_code = app_timer_start(m_startup_delay_timer_id, STARTUP_DELAY, NULL);
    APP_ERROR_CHECK(err_code);


    while (m_startup_delay) 
    { 
        idle_state_handle();
    }


    // Remainder of initialization
    rtc_config();
    buttons_leds_init(&erase_bonds);
    power_management_init();
    ble_stack_init();
    sd_power_dcdc_mode_set(NRF_POWER_DCDC_ENABLE);
    gap_params_init();
    gatt_init();
    services_init();
    advertising_init();
    conn_params_init();
    peer_manager_init();
    err_code = app_timer_start(m_temperature_timer_id, TEMPERATURE_PERIOD, NULL);
    APP_ERROR_CHECK(err_code);
    // Start execution.
    NRF_LOG_INFO("EEG/EMG monitoring started.");
//    application_timers_start();
    advertising_start(erase_bonds);
    SEGGER_RTT_printf(0,"BLE adv started\n");

    // wait for RTC to finish initializing
    while (!m_rtc_init) 
    { 
        idle_state_handle();
    }

    spi_init();

#if USE_EEG
    //initialize the EEG device
    m_eeg_dev.spi_instance_id = EEG_SPI_INSTANCE;
    m_eeg_dev.spi_xfer = spi_transfer;
    max30003_init(&m_eeg_dev);

    SEGGER_RTT_printf(0, "Done EEG init!\r\n");
#endif

