wouyanglv/ble-archives/nRF5_SDK_17.0.0_9d13099/examples/ble_peripheral/eeg_emg_v1_samplespacked_PCB_app_BLEtemperature/main.c
#if USE_EMG
    //initialize the EMG device
    m_emg_dev.spi_instance_id = EMG_SPI_INSTANCE;
    m_emg_dev.spi_xfer = spi_transfer;
    max30003_init(&m_emg_dev);

    SEGGER_RTT_printf(0, "Done EMG init!\r\n");
#endif

    SEGGER_RTT_printf(0, "Init done.\r\n");
    SEGGER_RTT_printf(0, "Waiting for BLE connection...\r\n");

    m_sample_num[EEG_SPI_INSTANCE] = 0;
    m_sample_num[EMG_SPI_INSTANCE] = 0;

#if USE_EEG
    m_eeg_data_avail = false;
    max30003_start_data(&m_eeg_dev, eeg_data_avail_handler);
#endif

#if USE_EMG
    m_emg_data_avail = false;
    max30003_start_data(&m_emg_dev, emg_data_avail_handler);
#endif

    // Enter main loop.
    while (1)
    {

         //  if (m_conn_handle != BLE_CONN_HANDLE_INVALID)
      //  { 
           
            if (m_emg_data_avail)
            {
                read_sensor_data(&m_emg_dev, BLE_BIOSIG_DEV_TYPE_EMG);
                m_emg_data_avail = false;
            } 
             if (m_eeg_data_avail)
            {
               read_sensor_data(&m_eeg_dev, BLE_BIOSIG_DEV_TYPE_EEG);
               m_eeg_data_avail = false;

            }
            

            //m_conn_handle != BLE_CONN_HANDLE_INVALID && 

            if (m_conn_handle != BLE_CONN_HANDLE_INVALID && EEG_read == true && EMG_read == true)
            {

              err_code = ble_biosig_svc_measurement_send(&m_biosig_svc, MODALITY_EEGEMG, FRAME_NUM,
                                          2, eeg_emg_buffer);
              EEG_read = false;
              EMG_read = false;
            }

      //  }


        idle_state_handle();
    }
}
